## EDA을 위한 다양한 pandas function 연습  
---
참고링크 : https://pandas.pydata.org/docs/user_guide/10min.html  
한글 : https://dandyrilla.github.io/2017-08-12/pandas-10min/

API ref : https://pandas.pydata.org/docs/reference/index.html

In [373]:
import numpy as np
import pandas as pd

### series and dataFrame 

차이점을 기억해 두자  
series 1차 배열  
dataFrame 2차 배열  

실제 data 특성에 맞는 샘플 데이터를 만들수 있어야 한다.   
해당 샘플 데이터로 각 연산 결과를 미리 확인 할 수 있어야 한다.   
print(type()) 을 이용하여 object 의 타입을 정확히 파악해야 한다.  
( series[index_label] vs dataframe[column_label] )  
answer.ipynb 와 test.ipynb, sample.ipynb 으로 운영한다. 

```
pd.DataFrame( Serise, 
              columns = ['',''])
              index = lsit
            )

pd.DataFrame(
    { 
      'A': list
      'B': ['', '']
    },
    index=['','']
    )
```

In [374]:
pd.DataFrame({ 
    'B': ['B', 'C'],
}, index= [1,2])

   B
1  B
2  C

In [375]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [376]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [377]:
# df 만드든 방법 1

df = pd.DataFrame(np.random.randn(6, 4),
                   index=dates, 
                   columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -0.526610  0.571616  0.013088  0.412091
2013-01-02  0.309664 -0.305446  1.952074  0.092912
2013-01-03  2.351451  0.153940 -0.463842  0.525333
2013-01-04  0.218938 -0.103083  0.389970 -0.302999
2013-01-05 -0.432622  0.350837  0.334930  0.586558
2013-01-06 -1.050539  1.515780  0.394338 -0.164548

In [378]:
S = df.A
S[1:]   # silicing

S[1]  # serise indexiting
S[S>1] # serise masking

2013-01-03    2.351451
Freq: D, Name: A, dtype: float64

In [379]:

D = df[['A','B']]

D[1:]   # df slicing
# D[1]    # indexing 은 오류
D[D>1]

                   A        B
2013-01-01       NaN      NaN
2013-01-02       NaN      NaN
2013-01-03  2.351451      NaN
2013-01-04       NaN      NaN
2013-01-05       NaN      NaN
2013-01-06       NaN  1.51578

dataFrame :   
DataFrame은 2차원 배열 데이터라고 이해하는 것보다 공통 인덱스를 가진 column series를 딕셔너리로 묶어놓은 것

In [380]:
# df 만드는 방법 2 

df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

df2 
# df2[:]
# df2[:][:]
# df2.loc[:,:]

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

### 2. Viewing Data

In [381]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [382]:
print(df.head(2),'\n')

print(df.tail(2), '\n')

print(df.index, '\n')

print(df.columns, '\n')

df.describe()

                   A         B         C         D
2013-01-01 -0.526610  0.571616  0.013088  0.412091
2013-01-02  0.309664 -0.305446  1.952074  0.092912

                   A         B         C         D
2013-01-05 -0.432622  0.350837  0.334930  0.586558
2013-01-06 -1.050539  1.515780  0.394338 -0.164548

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

Index(['A', 'B', 'C', 'D'], dtype='object')

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.145047  0.363941  0.436760  0.191558
std    1.192898  0.645031  0.812541  0.373415
min   -1.050539 -0.305446 -0.463842 -0.302999
25%   -0.503113 -0.038827  0.093548 -0.100183
50%   -0.106842  0.252389  0.362450  0.252501
75%    0.286982  0.516421  0.393246  0.497023
max    2.351451  1.515780  1.952074  0.586558

In [383]:
# 행, 열을 바꾼다. 

df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.526610    0.309664    2.351451    0.218938   -0.432622   -1.050539
B    0.571616   -0.305446    0.153940   -0.103083    0.350837    1.515780
C    0.013088    1.952074   -0.463842    0.389970    0.334930    0.394338
D    0.412091    0.092912    0.525333   -0.302999    0.586558   -0.164548

In [384]:
df.to_numpy()

array([[-0.5266098 ,  0.57161594,  0.01308766,  0.41209077],
       [ 0.30966356, -0.3054458 ,  1.95207445,  0.09291154],
       [ 2.35145058,  0.15393992, -0.46384162,  0.52533343],
       [ 0.2189378 , -0.10308285,  0.38997017, -0.30299858],
       [-0.43262203,  0.35083744,  0.33492964,  0.58655772],
       [-1.05053891,  1.51577958,  0.3943376 , -0.16454815]])

In [385]:
df.select_dtypes(include='int64')

Empty DataFrame
Columns: []
Index: [2013-01-01 00:00:00, 2013-01-02 00:00:00, 2013-01-03 00:00:00, 2013-01-04 00:00:00, 2013-01-05 00:00:00, 2013-01-06 00:00:00]

In [386]:
df.select_dtypes(include='number')

                   A         B         C         D
2013-01-01 -0.526610  0.571616  0.013088  0.412091
2013-01-02  0.309664 -0.305446  1.952074  0.092912
2013-01-03  2.351451  0.153940 -0.463842  0.525333
2013-01-04  0.218938 -0.103083  0.389970 -0.302999
2013-01-05 -0.432622  0.350837  0.334930  0.586558
2013-01-06 -1.050539  1.515780  0.394338 -0.164548

value_counts()

df.value_counts('col')   : col.unique() 한 값들의 갯수를 표시한다.   (전부 다른 값이면, 실재 row 갯수 만큼 나온다.)  
**= df.groupby('col').size()**  
series.value_counts() : col.unique() 한 값의 갯수를 표시한다.

In [387]:
df.groupby(['A']).size(),\
df.value_counts(['A'])

(A
 -1.050539    1
 -0.526610    1
 -0.432622    1
  0.218938    1
  0.309664    1
  2.351451    1
 dtype: int64,
 A
 -1.050539    1
 -0.526610    1
 -0.432622    1
  0.218938    1
  0.309664    1
  2.351451    1
 Name: count, dtype: int64)

### 3. Selection 

df[1] : 인텍싱  '정수일때만 가능 (df[df.index == 1] 가 같음), 주로 df 'column' 선택에 사용  
df[2:4] : 슬라이싱  
df[df>1] : 마스킹  

=> 주로 Serise 을 사용할때 사용한다고 생각하자. series[1] / series[2:4] / serise[serise>1]

.             : ```df.col```  
[]            : ```df[column]```         , * df[row_lable: ] 은 사용하지 말자.  
loc (or at)   : df.loc[index_lable,] 은 조건일때만 사용     , ```df.loc[ : , col_label]```    
iloc (or iat) : ```df.iloc[몇번째 row]``` , df.iloc[ : , 몇번째 col]

In [388]:
print(df['A'],'\n')
print(df[:]['A'],'\n')              #df.loc[:,'A']
# df['2013-01-01':]['A']            # chained indexing ?
# df.A

## column 을 선택하게 되며 series 로 리턴된다.


print(df[['A']],'\n')               # df 으로 리턴 
df[['A','C']]                       # dataFrame 리턴

## 2개 이상, 이거나 [[ 'col' ]] 으로 1개 col 을 df 로 리턴

2013-01-01   -0.526610
2013-01-02    0.309664
2013-01-03    2.351451
2013-01-04    0.218938
2013-01-05   -0.432622
2013-01-06   -1.050539
Freq: D, Name: A, dtype: float64

2013-01-01   -0.526610
2013-01-02    0.309664
2013-01-03    2.351451
2013-01-04    0.218938
2013-01-05   -0.432622
2013-01-06   -1.050539
Freq: D, Name: A, dtype: float64

                   A
2013-01-01 -0.526610
2013-01-02  0.309664
2013-01-03  2.351451
2013-01-04  0.218938
2013-01-05 -0.432622
2013-01-06 -1.050539

                   A         C
2013-01-01 -0.526610  0.013088
2013-01-02  0.309664  1.952074
2013-01-03  2.351451 -0.463842
2013-01-04  0.218938  0.389970
2013-01-05 -0.432622  0.334930
2013-01-06 -1.050539  0.394338

In [389]:
# 오류 

# print(df[0],'\n')                # 명시적 인덱스 0 을 찾기때문에 오류
# print(df['2013-01-01'],'\n')     # column 에서 찾기 때문에 오류 
print(df['2013-01-01':'2013-01-02'],'\n')  # 근데 이건 됨... 헐.
print(df[:'2013-01-02'],'\n')

                   A         B         C         D
2013-01-01 -0.526610  0.571616  0.013088  0.412091
2013-01-02  0.309664 -0.305446  1.952074  0.092912

                   A         B         C         D
2013-01-01 -0.526610  0.571616  0.013088  0.412091
2013-01-02  0.309664 -0.305446  1.952074  0.092912

In [390]:
# df[0:3]
# df['2013-01-01':'2013-01-03']
print(df['2013-01-04':], '\n')
print(df['2013-01-04':'2013-01-04'], '\n')     # 3, 4 열, label 은 끝 포함
print(df[3:4], '\n')                           # 3열만, index 은 -1 까지
df[3:]

# row 을 선택하게 되며, dataFrame 으로 리턴된다

                   A         B         C         D
2013-01-04  0.218938 -0.103083  0.389970 -0.302999
2013-01-05 -0.432622  0.350837  0.334930  0.586558
2013-01-06 -1.050539  1.515780  0.394338 -0.164548

                   A         B        C         D
2013-01-04  0.218938 -0.103083  0.38997 -0.302999

                   A         B        C         D
2013-01-04  0.218938 -0.103083  0.38997 -0.302999

                   A         B         C         D
2013-01-04  0.218938 -0.103083  0.389970 -0.302999
2013-01-05 -0.432622  0.350837  0.334930  0.586558
2013-01-06 -1.050539  1.515780  0.394338 -0.164548

In [391]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [392]:
print(df2[:3])  # 이런 형태는 사용하지 말자.  3번째 까지, column 이랑 혼동된다.
# df2.iloc[,:3] 3번째 columns 까지 인건지, df2.iloc[:3,] 3번째 row 인건지??

print(df2.loc[:3,])  # 이것도 사용하지 말자.  3번 까지 , 3번이 어디있을줄 알고... 
# 정수형이 아니면 df.loc[:'서울',] 이건 괜찬을듯.

df2.iloc[:3,]   # 이걸 사용하자. 3번째 까지

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo

In [393]:
#chained indexing?
print(df2[2:4]['A'],'\n')     # row / col
print(df2[2:4][0:4], '\n')     # row seriese 의 row serise
df2[2:4][0:1]                 # 2,3 row 로 만들어진 것에서 다시 0,1 row 첫번째

2    1.0
3    1.0
Name: A, dtype: float64

     A          B    C  D      E    F
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

     A          B    C  D     E    F
2  1.0 2013-01-02  1.0  3  test  foo

In [394]:
df2.iloc[0]     # 암묵적 인덱스 0 번째 선택

A                    1.0
B    2013-01-02 00:00:00
C                    1.0
D                      3
E                   test
F                    foo
Name: 0, dtype: object

In [395]:
df2.loc[2]        # 명시적 인덱스 2 선택

A                    1.0
B    2013-01-02 00:00:00
C                    1.0
D                      3
E                   test
F                    foo
Name: 2, dtype: object

Row

df.shape[0] = row 행갯수

df.iloc[몇번째 row,]  
df.loc[row_label,]  ```---> row_label 대신 조건절이 들어가면 조건절은 해당 row 의 index label 을 리턴한다.```

으로만 사용

In [396]:
df2.shape, df2.shape[0], df2.shape[1]

((4, 6), 4, 6)

In [397]:
# row label (명시적, 몇번) 을 이용해서 row 을 인덱싱
# index 가 int 인 경우 df.loc[index_int] 도 가능, 
print(df.loc['20130101'],'\n')              # series
print(df.loc['20130101':'20130102'],'\n')   # dataFrame
print(df.loc[['20130101','20130102']],'\n')

# row location (암묵적 , 몇번째) index 을 이용해서 row 인덱싱
print(df.iloc[0],'\n')                      # series
print(df.iloc[0:1],'\n')                    #dataFrame
print(df.iloc[[0,1]],'\n')

A   -0.526610
B    0.571616
C    0.013088
D    0.412091
Name: 2013-01-01 00:00:00, dtype: float64

                   A         B         C         D
2013-01-01 -0.526610  0.571616  0.013088  0.412091
2013-01-02  0.309664 -0.305446  1.952074  0.092912

                   A         B         C         D
2013-01-01 -0.526610  0.571616  0.013088  0.412091
2013-01-02  0.309664 -0.305446  1.952074  0.092912

A   -0.526610
B    0.571616
C    0.013088
D    0.412091
Name: 2013-01-01 00:00:00, dtype: float64

                  A         B         C         D
2013-01-01 -0.52661  0.571616  0.013088  0.412091

                   A         B         C         D
2013-01-01 -0.526610  0.571616  0.013088  0.412091
2013-01-02  0.309664 -0.305446  1.952074  0.092912

Column

df.shape[1] = columns 열갯수

특정 column 은 몇번째 column 인가? 는 어떻게 찾지?

```
columns 을 추가할때는 인덱스가 없는 list 형태로 입력해야 한다. 
그렇지 않으면, 인덱스가 서로 다를때 입력이 안될수 있다. 
```

In [398]:

# column lable 을 이용해서 column 인덱싱
# print(df.loc['A'],'\n')      # 'A' 을 row 인텍싱으로 생각해서 
print(df.loc[:,'A'],'\n')
print(df.loc[:, ['A']],'\n')
print(df.loc[:,'A':'B'],'\n')
print(df.loc[:,['A','B']],'\n')

2013-01-01   -0.526610
2013-01-02    0.309664
2013-01-03    2.351451
2013-01-04    0.218938
2013-01-05   -0.432622
2013-01-06   -1.050539
Freq: D, Name: A, dtype: float64

                   A
2013-01-01 -0.526610
2013-01-02  0.309664
2013-01-03  2.351451
2013-01-04  0.218938
2013-01-05 -0.432622
2013-01-06 -1.050539

                   A         B
2013-01-01 -0.526610  0.571616
2013-01-02  0.309664 -0.305446
2013-01-03  2.351451  0.153940
2013-01-04  0.218938 -0.103083
2013-01-05 -0.432622  0.350837
2013-01-06 -1.050539  1.515780

                   A         B
2013-01-01 -0.526610  0.571616
2013-01-02  0.309664 -0.305446
2013-01-03  2.351451  0.153940
2013-01-04  0.218938 -0.103083
2013-01-05 -0.432622  0.350837
2013-01-06 -1.050539  1.515780

In [399]:
df.head()

                   A         B         C         D
2013-01-01 -0.526610  0.571616  0.013088  0.412091
2013-01-02  0.309664 -0.305446  1.952074  0.092912
2013-01-03  2.351451  0.153940 -0.463842  0.525333
2013-01-04  0.218938 -0.103083  0.389970 -0.302999
2013-01-05 -0.432622  0.350837  0.334930  0.586558

In [400]:

# column locatin (몇번째) index 을 이용해서 column 인덱싱
print(df.iloc[0],'\n')          # 0 을 row 인텍싱으로 생각해서 0번째 location row 을 인텍싱
print(df.iloc[:,0],'\n')        # 0 번째 column series 리턴
print(df.iloc[:,[0]])           # 0 번째 column df 리턴

A   -0.526610
B    0.571616
C    0.013088
D    0.412091
Name: 2013-01-01 00:00:00, dtype: float64

2013-01-01   -0.526610
2013-01-02    0.309664
2013-01-03    2.351451
2013-01-04    0.218938
2013-01-05   -0.432622
2013-01-06   -1.050539
Freq: D, Name: A, dtype: float64

                   A
2013-01-01 -0.526610
2013-01-02  0.309664
2013-01-03  2.351451
2013-01-04  0.218938
2013-01-05 -0.432622
2013-01-06 -1.050539

In [401]:
print(df.iloc[:,0:2],'\n')

                   A         B
2013-01-01 -0.526610  0.571616
2013-01-02  0.309664 -0.305446
2013-01-03  2.351451  0.153940
2013-01-04  0.218938 -0.103083
2013-01-05 -0.432622  0.350837
2013-01-06 -1.050539  1.515780

In [402]:
print(df.iloc[:,[0,1,3]],'\n')

                   A         B         D
2013-01-01 -0.526610  0.571616  0.412091
2013-01-02  0.309664 -0.305446  0.092912
2013-01-03  2.351451  0.153940  0.525333
2013-01-04  0.218938 -0.103083 -0.302999
2013-01-05 -0.432622  0.350837  0.586558
2013-01-06 -1.050539  1.515780 -0.164548

In [403]:
# column 이름 바꾸기
df.rename({'A':'a'},axis=1)

                   a         B         C         D
2013-01-01 -0.526610  0.571616  0.013088  0.412091
2013-01-02  0.309664 -0.305446  1.952074  0.092912
2013-01-03  2.351451  0.153940 -0.463842  0.525333
2013-01-04  0.218938 -0.103083  0.389970 -0.302999
2013-01-05 -0.432622  0.350837  0.334930  0.586558
2013-01-06 -1.050539  1.515780  0.394338 -0.164548

In [404]:
# column suffix 추가 
df.add_suffix('_S')

                 A_S       B_S       C_S       D_S
2013-01-01 -0.526610  0.571616  0.013088  0.412091
2013-01-02  0.309664 -0.305446  1.952074  0.092912
2013-01-03  2.351451  0.153940 -0.463842  0.525333
2013-01-04  0.218938 -0.103083  0.389970 -0.302999
2013-01-05 -0.432622  0.350837  0.334930  0.586558
2013-01-06 -1.050539  1.515780  0.394338 -0.164548

In [405]:
df.loc[::-1]   # row 순서 역순

                   A         B         C         D
2013-01-06 -1.050539  1.515780  0.394338 -0.164548
2013-01-05 -0.432622  0.350837  0.334930  0.586558
2013-01-04  0.218938 -0.103083  0.389970 -0.302999
2013-01-03  2.351451  0.153940 -0.463842  0.525333
2013-01-02  0.309664 -0.305446  1.952074  0.092912
2013-01-01 -0.526610  0.571616  0.013088  0.412091

In [406]:
df.loc[:,::-1]  # column 역순

                   D         C         B         A
2013-01-01  0.412091  0.013088  0.571616 -0.526610
2013-01-02  0.092912  1.952074 -0.305446  0.309664
2013-01-03  0.525333 -0.463842  0.153940  2.351451
2013-01-04 -0.302999  0.389970 -0.103083  0.218938
2013-01-05  0.586558  0.334930  0.350837 -0.432622
2013-01-06 -0.164548  0.394338  1.515780 -1.050539

Chained indexing

In [407]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [408]:
df2.loc[0:2,'A']

0    1.0
1    1.0
2    1.0
Name: A, dtype: float64

In [409]:
print(df2.loc[[0,1],['A','B']])    # 숫자가 lable 이다 df[[0,1]] 은 오류
print(df2.iloc[[0,1],[0,1]])

     A          B
0  1.0 2013-01-02
1  1.0 2013-01-02
     A          B
0  1.0 2013-01-02
1  1.0 2013-01-02

In [410]:
df

                   A         B         C         D
2013-01-01 -0.526610  0.571616  0.013088  0.412091
2013-01-02  0.309664 -0.305446  1.952074  0.092912
2013-01-03  2.351451  0.153940 -0.463842  0.525333
2013-01-04  0.218938 -0.103083  0.389970 -0.302999
2013-01-05 -0.432622  0.350837  0.334930  0.586558
2013-01-06 -1.050539  1.515780  0.394338 -0.164548

In [411]:
df[2:6][df[2:6].A < 0][1:2]

# df 의 2부터 6 row 중 A column  값이 0 보다 작은 두번재 row

                   A        B         C         D
2013-01-06 -1.050539  1.51578  0.394338 -0.164548

In [412]:
print(df[2:6])
print(df[2:6].A<0)

# 2개의 index가 같아야 한다. 
# IndexingError: Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match).

                   A         B         C         D
2013-01-03  2.351451  0.153940 -0.463842  0.525333
2013-01-04  0.218938 -0.103083  0.389970 -0.302999
2013-01-05 -0.432622  0.350837  0.334930  0.586558
2013-01-06 -1.050539  1.515780  0.394338 -0.164548
2013-01-03    False
2013-01-04    False
2013-01-05     True
2013-01-06     True
Freq: D, Name: A, dtype: bool

Boolean indexing

```(df[])[(df[]) 조건][column]```  
```(df[]).loc[ (df[]) 조건 , column ]```

iloc 는 boolean index 을 사용할 수 없다.  
iLocation based boolean indexing on an integer type is not available

In [413]:
A_over_0 = df['A']>0
df[A_over_0]['B'] 
# df.loc[A_over_0, 'B']

2013-01-02   -0.305446
2013-01-03    0.153940
2013-01-04   -0.103083
Freq: D, Name: B, dtype: float64

In [414]:
df.loc[A_over_0,'B']

2013-01-02   -0.305446
2013-01-03    0.153940
2013-01-04   -0.103083
Freq: D, Name: B, dtype: float64

In [415]:
print(df[1:5].A > 0)  # 이거 대신
df.iloc[1:5].A > 0   # 이걸 사용하자

2013-01-02     True
2013-01-03     True
2013-01-04     True
2013-01-05    False
Freq: D, Name: A, dtype: bool

2013-01-02     True
2013-01-03     True
2013-01-04     True
2013-01-05    False
Freq: D, Name: A, dtype: bool

In [416]:
df.iloc[1:5][df.iloc[1:5].A >0]

                   A         B         C         D
2013-01-02  0.309664 -0.305446  1.952074  0.092912
2013-01-03  2.351451  0.153940 -0.463842  0.525333
2013-01-04  0.218938 -0.103083  0.389970 -0.302999

In [417]:
df[1:5][df[1:5].A > 0]   # chained indexing ???

                   A         B         C         D
2013-01-02  0.309664 -0.305446  1.952074  0.092912
2013-01-03  2.351451  0.153940 -0.463842  0.525333
2013-01-04  0.218938 -0.103083  0.389970 -0.302999

In [418]:
# df[df[1:5].A > 0]  은 오류가 난다.  df 의 index <-> df[1:5] 의 index 가 서로 맞지않다.
# 조건에 대한 true 값의 index label '2013-01-02' 을 리턴한다.
# 따라서 df['2013-01-02'] 가 오류

df[1:5].A > 0

2013-01-02     True
2013-01-03     True
2013-01-04     True
2013-01-05    False
Freq: D, Name: A, dtype: bool

In [419]:
# Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match).

# df.loc[df[1:3].A > 0] 
df[1:3].loc[df[1:3].A >0]

                   A         B         C         D
2013-01-02  0.309664 -0.305446  1.952074  0.092912
2013-01-03  2.351451  0.153940 -0.463842  0.525333

In [420]:
df[1:3][df[0:4].A  > 0]['B']

/var/folders/yn/xbyfmttd1tdc740qcs27ft9m0000gn/T/ipykernel_1169/1907405889.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df[1:3][df[0:4].A  > 0]['B']

2013-01-02   -0.305446
2013-01-03    0.153940
Freq: D, Name: B, dtype: float64

In [421]:
#  UserWarning: Boolean Series key will be reindexed to match DataFrame index. 해결방법 

X = df[1:3]
X[X[0:4].A > 0]['B']

2013-01-02   -0.305446
2013-01-03    0.153940
Freq: D, Name: B, dtype: float64

In [422]:
df[1:3][df[1:3].A > 0]['B']
# df1 = df[1:3]
# df1.A > 0
# df1['B']

2013-01-02   -0.305446
2013-01-03    0.153940
Freq: D, Name: B, dtype: float64

funtion indexing

```
pipe()  : Tablewise Function Application
apply() : Row or Column-wise Function Application (df 적용, 행/열 전달. groupby 적용 그룹 전달)
agg() and transform() : Aggregation API
map() : Series 에서 값에 적용한다. (Series 적용, 값 전달)
applymap() : Applying Elementwise Functions  (df 적용, 값을 전달)

pd.cut()    : 조건에 따른 구간별 label  (pd.qcut() : 균등분할)
np.where()  : 조건에 따른 값표시 (아닌값은 NaN)
```

In [423]:
df

                   A         B         C         D
2013-01-01 -0.526610  0.571616  0.013088  0.412091
2013-01-02  0.309664 -0.305446  1.952074  0.092912
2013-01-03  2.351451  0.153940 -0.463842  0.525333
2013-01-04  0.218938 -0.103083  0.389970 -0.302999
2013-01-05 -0.432622  0.350837  0.334930  0.586558
2013-01-06 -1.050539  1.515780  0.394338 -0.164548

In [424]:
df3 = df.copy()
df3['sum_row'] = df3.apply(np.sum,axis=1)    # df3.sum(axis=1) 과 같다.
df3

                   A         B         C         D   sum_row
2013-01-01 -0.526610  0.571616  0.013088  0.412091  0.470185
2013-01-02  0.309664 -0.305446  1.952074  0.092912  2.049204
2013-01-03  2.351451  0.153940 -0.463842  0.525333  2.566882
2013-01-04  0.218938 -0.103083  0.389970 -0.302999  0.202827
2013-01-05 -0.432622  0.350837  0.334930  0.586558  0.839703
2013-01-06 -1.050539  1.515780  0.394338 -0.164548  0.695030

In [425]:
# 전체 row 을 순회 (axis =1) 해서 row 갯수 크기의 series 전달

df3["result"] = df3.apply(lambda r: "Over" if r.sum_row > 0 else "Under", axis=1)
df3

                   A         B         C         D   sum_row result
2013-01-01 -0.526610  0.571616  0.013088  0.412091  0.470185   Over
2013-01-02  0.309664 -0.305446  1.952074  0.092912  2.049204   Over
2013-01-03  2.351451  0.153940 -0.463842  0.525333  2.566882   Over
2013-01-04  0.218938 -0.103083  0.389970 -0.302999  0.202827   Over
2013-01-05 -0.432622  0.350837  0.334930  0.586558  0.839703   Over
2013-01-06 -1.050539  1.515780  0.394338 -0.164548  0.695030   Over

In [426]:
# bins=[-100,0,100]
# labels =['under','over']      # bins 보다 하나 적은 갯수 (사이값) 이어야 한다.
pd.cut(df3.sum_row, bins=[-100,0,100], labels=['under','over'] )

2013-01-01    over
2013-01-02    over
2013-01-03    over
2013-01-04    over
2013-01-05    over
2013-01-06    over
Freq: D, Name: sum_row, dtype: category
Categories (2, object): ['under' < 'over']

In [427]:
df3 = df3.drop(columns='result')
df3

                   A         B         C         D   sum_row
2013-01-01 -0.526610  0.571616  0.013088  0.412091  0.470185
2013-01-02  0.309664 -0.305446  1.952074  0.092912  2.049204
2013-01-03  2.351451  0.153940 -0.463842  0.525333  2.566882
2013-01-04  0.218938 -0.103083  0.389970 -0.302999  0.202827
2013-01-05 -0.432622  0.350837  0.334930  0.586558  0.839703
2013-01-06 -1.050539  1.515780  0.394338 -0.164548  0.695030

In [428]:
df3.where((df3.sum_row>0) & (df3.B>0))    # boolean 으로 리턴하지 않고, 값을 리턴 하다. dropna() 을 붙일수 있다.

                   A         B         C         D   sum_row
2013-01-01 -0.526610  0.571616  0.013088  0.412091  0.470185
2013-01-02       NaN       NaN       NaN       NaN       NaN
2013-01-03  2.351451  0.153940 -0.463842  0.525333  2.566882
2013-01-04       NaN       NaN       NaN       NaN       NaN
2013-01-05 -0.432622  0.350837  0.334930  0.586558  0.839703
2013-01-06 -1.050539  1.515780  0.394338 -0.164548  0.695030

In [429]:
df3[(df3.sum_row>0) & (df3.B>0)]

# dropna() 까지 한 결과

                   A         B         C         D   sum_row
2013-01-01 -0.526610  0.571616  0.013088  0.412091  0.470185
2013-01-03  2.351451  0.153940 -0.463842  0.525333  2.566882
2013-01-05 -0.432622  0.350837  0.334930  0.586558  0.839703
2013-01-06 -1.050539  1.515780  0.394338 -0.164548  0.695030

In [430]:
# df.query  을  사용

df3.query("sum_row > 0 and B >0")

                   A         B         C         D   sum_row
2013-01-01 -0.526610  0.571616  0.013088  0.412091  0.470185
2013-01-03  2.351451  0.153940 -0.463842  0.525333  2.566882
2013-01-05 -0.432622  0.350837  0.334930  0.586558  0.839703
2013-01-06 -1.050539  1.515780  0.394338 -0.164548  0.695030

### 4. Missing 

``` 
dropna()
fillna()
notnull()
notna()   
isnull()
isna() 
```

In [431]:
df3.where((df3.sum_row>0) & (df3.B>0)).fillna(0)

                   A         B         C         D   sum_row
2013-01-01 -0.526610  0.571616  0.013088  0.412091  0.470185
2013-01-02  0.000000  0.000000  0.000000  0.000000  0.000000
2013-01-03  2.351451  0.153940 -0.463842  0.525333  2.566882
2013-01-04  0.000000  0.000000  0.000000  0.000000  0.000000
2013-01-05 -0.432622  0.350837  0.334930  0.586558  0.839703
2013-01-06 -1.050539  1.515780  0.394338 -0.164548  0.695030

In [432]:
# 공백 값 (셀 값이 없음) 제거 

df_sp = pd.DataFrame({
    'A': range(6),
    'B': ['foo', '', 'bar', '', np.nan, 'xyz']
})
df_sp

   A    B
0  0  foo
1  1
2  2  bar
3  3
4  4  NaN
5  5  xyz

In [433]:
# unique() 로 공백을 확인 할 수 있다. 

df_sp['B'].unique()

array(['foo', '', 'bar', nan, 'xyz'], dtype=object)

In [434]:
# 공백('') 을 np.nan 으로 변경 

df_sp['B'] = df_sp['B'].replace('',np.nan)
df_sp['B'].unique()

array(['foo', nan, 'bar', 'xyz'], dtype=object)

### 5. Operations

```
sum, mean, std, var
sort, count
apply
str
```

In [435]:
print(df.sort_index())
print(df.sort_values('A'),'\n')
# df.sort_values(by='A')
print(df.sort_values(by= ['A','B'],ascending=False))

                   A         B         C         D
2013-01-01 -0.526610  0.571616  0.013088  0.412091
2013-01-02  0.309664 -0.305446  1.952074  0.092912
2013-01-03  2.351451  0.153940 -0.463842  0.525333
2013-01-04  0.218938 -0.103083  0.389970 -0.302999
2013-01-05 -0.432622  0.350837  0.334930  0.586558
2013-01-06 -1.050539  1.515780  0.394338 -0.164548
                   A         B         C         D
2013-01-06 -1.050539  1.515780  0.394338 -0.164548
2013-01-01 -0.526610  0.571616  0.013088  0.412091
2013-01-05 -0.432622  0.350837  0.334930  0.586558
2013-01-04  0.218938 -0.103083  0.389970 -0.302999
2013-01-02  0.309664 -0.305446  1.952074  0.092912
2013-01-03  2.351451  0.153940 -0.463842  0.525333

                   A         B         C         D
2013-01-03  2.351451  0.153940 -0.463842  0.525333
2013-01-02  0.309664 -0.305446  1.952074  0.092912
2013-01-04  0.218938 -0.103083  0.389970 -0.302999
2013-01-05 -0.432622  0.350837  0.334930  0.586558
2013-01-01 -0.526610  0.571616  0.013088  0.412091
2013-01-06 -1.050539  1.515780  0.394338 -0.164548

In [436]:
print(df.sum())          # row 들의 합 (col : 합) axis=0 디폴트
print(df.sum(axis=1))    # column 들의 함 (row : 합) axis=1

A    0.870281
B    2.183644
C    2.620558
D    1.149347
dtype: float64
2013-01-01    0.470185
2013-01-02    2.049204
2013-01-03    2.566882
2013-01-04    0.202827
2013-01-05    0.839703
2013-01-06    0.695030
Freq: D, dtype: float64

### 6. Merging

```
concat
join
merge
```

### 7. Grouping

```
Splitting the data into groups based on some criteria
Applying a function to each group independently
Combining the results into a data structure

1. 새로운 df (groupby index) 을 생성할 것인가? 

2. 기존 df 에서 groupby 로 계산한 후, 업데이트 할 것인가?
Groupby 로 새로운 인덱스가 생성이되므로, 
apply 로 인해 각 row 별로 계산된 값은 
groupby 로 생성된 인덱스를 삭제하고,
gorupby 로 sort 된것을 기존 인덱스를 이용해 복구 해야 한다. 

=> transform 을 사용하면 계산을 한 후, 기존 인덱스로 되돌려 준다. 
=> 그러나, 하나의 열 또는 행을 조작하는 것이지, 전체 데이터 프레임을 한번에 연산할 수 없다. 

=> 그룹화된 복수개 컬럼 연산 : apply (멀티 인덱스)  
=> for + 그룹화된 1개 컬럼 연산 : transform (기존 인덱스)  

```

In [437]:
df_g = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

df_g

     A      B         C         D
0  foo    one  1.079317 -0.348177
1  bar    one -1.659787  0.994029
2  foo    two -1.086505 -0.223715
3  bar  three  0.273555 -0.727172
4  foo    two  0.375928  0.062013
5  bar    two -0.142966  1.140916
6  foo    one -2.044099  0.484725
7  foo  three  0.301025  1.335506

In [438]:
def funT(Ag):
    over0=Ag > 0
    Ag[over0] = Ag[over0] + 1000
    return Ag

df_g.groupby('A')['C'].apply(funT)#.reset_index(level=0,drop=True).sort_index()
# apply 을 사용할 경우 groupby 에 의한 인덱스된 기준이므로 바로 기존 df 입력이 불가하다.
# df_g['C'] = df_g.groupby('A')['C'].apply(funT) 

# 추가로 reset_index(level=0,drop=True).sort_index() 을 해 주어야 한다.
# level 을 정해주지 않으면 기존 index 을 모두 지우고 리셋한다. (주의할 것)
# 그러나 transform() 을 사용하면 바로 적용이 가능하다.

# groupyby(A) 로 묶은 다음 C 값에 한하여 0 보다 큰 값을 갖은 데이터 대상 C 값 연산

A
bar  1      -1.659787
     3    1000.273555
     5      -0.142966
foo  0    1001.079317
     2      -1.086505
     4    1000.375928
     6      -2.044099
     7    1000.301025
Name: C, dtype: float64

In [439]:
df_gt = df_g.copy()
df_gt['C'] = df_g.groupby('A')['C'].transform(funT)
df_gt

     A      B            C         D
0  foo    one  1001.079317 -0.348177
1  bar    one    -1.659787  0.994029
2  foo    two    -1.086505 -0.223715
3  bar  three  1000.273555 -0.727172
4  foo    two  1000.375928  0.062013
5  bar    two    -0.142966  1.140916
6  foo    one    -2.044099  0.484725
7  foo  three  1000.301025  1.335506

In [440]:
# groupyby(A) 로 묶은 다음 C 값에 한하여 0 보다 큰 값을 갖은 데이터 대상으로 D 값을 연산

def funT(Ag):
    over0=Ag['C'] > 0
    Ag.loc[over0,'D'] = Ag.loc[over0,'D']+1000
    return Ag

df_g.groupby(['A','B']).apply(funT)#.reset_index(level = (0,1), drop=True)

# multi-index 에서는 reset_index(level = (0,1), drop=True) 을 해야 한다. 
# level 설정을 하지 않으면, A-B-index 을 모두 지우고, 다시 이 순서로 index 을 붙인다. (주의할것 )

               A      B         C            D
A   B
bar one   1  bar    one -1.659787     0.994029
    three 3  bar  three  0.273555   999.272828
    two   5  bar    two -0.142966     1.140916
foo one   0  foo    one  1.079317   999.651823
          6  foo    one -2.044099     0.484725
    three 7  foo  three  0.301025  1001.335506
    two   2  foo    two -1.086505    -0.223715
          4  foo    two  0.375928  1000.062013

In [441]:

df_g.groupby(['A']).apply(funT).reset_index(level=0,drop=True)#.sort_index()

     A      B         C            D
1  bar    one -1.659787     0.994029
3  bar  three  0.273555   999.272828
5  bar    two -0.142966     1.140916
0  foo    one  1.079317   999.651823
2  foo    two -1.086505    -0.223715
4  foo    two  0.375928  1000.062013
6  foo    one -2.044099     0.484725
7  foo  three  0.301025  1001.335506

In [442]:
# reset_index 에서 level 을 설정하지 않으면, A-index을 모두 지우고 index 을 다시 설정한다.

df_g.groupby(['A']).apply(funT).reset_index(drop=True)#.sort_index()

     A      B         C            D
0  bar    one -1.659787     0.994029
1  bar  three  0.273555   999.272828
2  bar    two -0.142966     1.140916
3  foo    one  1.079317   999.651823
4  foo    two -1.086505    -0.223715
5  foo    two  0.375928  1000.062013
6  foo    one -2.044099     0.484725
7  foo  three  0.301025  1001.335506

df.groupby().apply(list)

df.groupby().groups.keys()

In [443]:
df_g.groupby(['A','B'])['C'].apply(list)

A    B
bar  one                          [-1.6597867689620847]
     three                        [0.27355534069074466]
     two                          [-0.1429663332887827]
foo  one       [1.0793171828625394, -2.044099392897594]
     three                         [0.3010251958833434]
     two      [-1.0865048850749417, 0.3759283563830937]
Name: C, dtype: object

In [444]:
df_g.groupby(['A','B'])['C'].groups.keys()

dict_keys([('bar', 'one'), ('bar', 'three'), ('bar', 'two'), ('foo', 'one'), ('foo', 'three'), ('foo', 'two')])

In [445]:
df_g.groupby(['A','B'])['C'].ngroup()

# 각 row 들이 어떻게 groupping 되는가.
# 0 3 : index 0 은 3번 그룹으로 묶임 / 6 3 : index 6 번도 3번 그룹으로 묶임
# df['groupN'] = df.groupby().ngroup()  을 생성해서 몇개 그룹이 만들어 지고, 어떻게 구성되는지 알수 있다.

0    3
1    0
2    5
3    1
4    5
5    2
6    3
7    4
dtype: int64

In [446]:
for key, group in df_g.groupby(['A','B'])['C']:
    print(key, group)

('bar', 'one') 1   -1.659787
Name: C, dtype: float64
('bar', 'three') 3    0.273555
Name: C, dtype: float64
('bar', 'two') 5   -0.142966
Name: C, dtype: float64
('foo', 'one') 0    1.079317
6   -2.044099
Name: C, dtype: float64
('foo', 'three') 7    0.301025
Name: C, dtype: float64
('foo', 'two') 2   -1.086505
4    0.375928
Name: C, dtype: float64

In [447]:
for key, group in df_g.groupby(['A','B']):
    print(key,group)

('bar', 'one')      A    B         C         D
1  bar  one -1.659787  0.994029
('bar', 'three')      A      B         C         D
3  bar  three  0.273555 -0.727172
('bar', 'two')      A    B         C         D
5  bar  two -0.142966  1.140916
('foo', 'one')      A    B         C         D
0  foo  one  1.079317 -0.348177
6  foo  one -2.044099  0.484725
('foo', 'three')      A      B         C         D
7  foo  three  0.301025  1.335506
('foo', 'two')      A    B         C         D
2  foo  two -1.086505 -0.223715
4  foo  two  0.375928  0.062013

multi-index

In [448]:
df_g.groupby(['A','B'])[['C']].size().xs(('bar','one'),level=(0,1))

A    B
bar  one    1
dtype: int64

In [449]:
df_g.groupby(['A','B'])[['C']].size().xs(('one'),level=(1))

A
bar    1
foo    2
dtype: int64

[].reset_index / [[]].reset_index

In [450]:

df_g.groupby(['A','B'])['C'].value_counts().reset_index()

# df_g.groupby(['A','B'])['C'].value_counts().reset_index() 
# -> reset_index(level = (0,1), drop=True) 을 해야 한다. 
# new_df_g = df_g.groupby(['A','B'])['C'].value_counts()
# new_df_g.name = C_count
# new_df_g.reset_index()

     A      B         C  count
0  bar    one -1.659787      1
1  bar  three  0.273555      1
2  bar    two -0.142966      1
3  foo    one -2.044099      1
4  foo    one  1.079317      1
5  foo  three  0.301025      1
6  foo    two -1.086505      1
7  foo    two  0.375928      1

In [451]:
df_g.groupby('A').value_counts('B')

A    B
bar  one      1
     three    1
     two      1
foo  one      2
     two      2
     three    1
Name: count, dtype: int64

In [452]:
# [C] 은 데이터 프레임이라서 reset_index 가 가능하다. 
# groupby 로 인텍스화 되었던 A,B 가 columns 으로 재 배치 되고, 
# A B 의 unique 한 조합으로 새로운 df index 이 생성됨.
# 기존 8x4 -> 6x3

df_g2 = df_g.groupby(['A','B'])['C'].sum().reset_index()
df_g2

     A      B         C
0  bar    one -1.659787
1  bar  three  0.273555
2  bar    two -0.142966
3  foo    one -0.964782
4  foo  three  0.301025
5  foo    two -0.710577

groupby().apply(funcX)

apply 와 transform 의 차이  
https://steadiness-193.tistory.com/42

In [453]:
df_g.groupby(['A','B']).apply(list)

# 전달되는 index 와 columns, 즉 df 을 볼수 있다.

A    B
bar  one      [A, B, C, D]
     three    [A, B, C, D]
     two      [A, B, C, D]
foo  one      [A, B, C, D]
     three    [A, B, C, D]
     two      [A, B, C, D]
dtype: object

In [454]:
# 6개 유닉크한 AB groupby 의 그룹 key 값이 전달된다.

def funX(groupbyKey : pd.DataFrame.groupby) -> pd.DataFrame.groupby:
    print(groupbyKey)
    groupbyKey['C'] =  groupbyKey['C'].sum()
    print(groupbyKey)

    return groupbyKey

newG = df_g.groupby(['A','B']).apply(funX)
newG

# groupby 기준으로 index 가 생성이되고, 기존 index 는 level=2 가 추가된 multi_index df 가 생성됨.
# 기존 df 형태로 되돌리기 위해서는 
# groupby 로 생성된 index 0, 1을 삭제하여 기존 인덱스를 살리고, groupby 로 sort 되었던것을 기존 인덱스로 재 sort 해야함
# .reset_index(drop=True, level=(0,1)).sort_index()   
# 을 해주어야 함.

     A    B         C         D
1  bar  one -1.659787  0.994029
     A    B         C         D
1  bar  one -1.659787  0.994029
     A      B         C         D
3  bar  three  0.273555 -0.727172
     A      B         C         D
3  bar  three  0.273555 -0.727172
     A    B         C         D
5  bar  two -0.142966  1.140916
     A    B         C         D
5  bar  two -0.142966  1.140916
     A    B         C         D
0  foo  one  1.079317 -0.348177
6  foo  one -2.044099  0.484725
     A    B         C         D
0  foo  one -0.964782 -0.348177
6  foo  one -0.964782  0.484725
     A      B         C         D
7  foo  three  0.301025  1.335506
     A      B         C         D
7  foo  three  0.301025  1.335506
     A    B         C         D
2  foo  two -1.086505 -0.223715
4  foo  two  0.375928  0.062013
     A    B         C         D
2  foo  two -0.710577 -0.223715
4  foo  two -0.710577  0.062013

               A      B         C         D
A   B
bar one   1  bar    one -1.659787  0.994029
    three 3  bar  three  0.273555 -0.727172
    two   5  bar    two -0.142966  1.140916
foo one   0  foo    one -0.964782 -0.348177
          6  foo    one -0.964782  0.484725
    three 7  foo  three  0.301025  1.335506
    two   2  foo    two -0.710577 -0.223715
          4  foo    two -0.710577  0.062013

In [456]:
df_g.groupby(['A','B']).transform(list)

# transform(funX) 는 사용할 수 없다. 
# KeyError: 'C'  : fun 안에서 C 을 구분하여 사용할 수 없다. 
# group 을 넘겨서 연산할 경우

          C         D
0  1.079317 -0.348177
1 -1.659787  0.994029
2 -1.086505 -0.223715
3  0.273555 -0.727172
4  0.375928  0.062013
5 -0.142966  1.140916
6 -2.044099  0.484725
7  0.301025  1.335506

In [186]:
newG.reset_index(drop=True,level=(0,1)).sort_index()

# groupby 로 계산을 하고, 원래 8x4 형태로 되돌아 옴.
# 기존 (groupby 이전) df 에 계산된 값을 업데이트 할 수 있음.

     A      B         C         D
0  foo    one -2.806363 -0.611445
1  bar    one  0.122473 -0.101776
2  foo    two  1.995558 -0.249892
3  bar  three -0.104899  0.153170
4  foo    two  1.995558 -0.298740
5  bar    two -1.928426  1.161292
6  foo    one -2.806363 -1.308144
7  foo  three -1.226200 -0.522922

In [187]:
# 연산한 컬럼을 지정하지 않으면, 모든 컬럼을 연산한다. 

def funX(groupbyKey : pd.DataFrame.groupby) -> pd.Series.groupby:
    print(groupbyKey)
    groupbyKey = groupbyKey.sum()
    print(groupbyKey)  # 전체 columns 의 sum 결과인 Series
    # groupbyKey = groupbyKey+1  # 은 받은 DataFrame.groupby 을 리턴한다.
    return groupbyKey

df_g.groupby(['A','B']).apply(funX)

# A,B str 까지 sum 됨. (multi-index)
# foofoo  oneone twotwo

     A    B         C         D
1  bar  one  0.122473 -0.101776
A         bar
B         one
C    0.122473
D   -0.101776
dtype: object
     A      B         C        D
3  bar  three -0.104899  0.15317
A         bar
B       three
C   -0.104899
D     0.15317
dtype: object
     A    B         C         D
5  bar  two -1.928426  1.161292
A         bar
B         two
C   -1.928426
D    1.161292
dtype: object
     A    B         C         D
0  foo  one -1.306910 -0.611445
6  foo  one -1.499453 -1.308144
A      foofoo
B      oneone
C   -2.806363
D   -1.919589
dtype: object
     A      B       C         D
7  foo  three -1.2262 -0.522922
A         foo
B       three
C     -1.2262
D   -0.522922
dtype: object
     A    B         C         D
2  foo  two  1.771779 -0.249892
4  foo  two  0.223779 -0.298740
A      foofoo
B      twotwo
C    1.995558
D   -0.548632
dtype: object

                A       B         C         D
A   B
bar one       bar     one  0.122473 -0.101776
    three     bar   three -0.104899  0.153170
    two       bar     two -1.928426  1.161292
foo one    foofoo  oneone -2.806363 -1.919589
    three     foo   three -1.226200 -0.522922
    two    foofoo  twotwo  1.995558 -0.548632

In [96]:
# transform 에서 연산할 컬럼을 지정하지 않은 경우
# 연산 가능한 컬럼만 연산하여 리턴한다. (기존 인덱스 유지)

df_g.groupby(['A','B']).transform(funX)

1    0.084099
Name: C, dtype: float64
0.08409864249418036
1   -0.032709
Name: D, dtype: float64
-0.03270935806248771
          C         D
1  0.084099 -0.032709
C    0.084099
D   -0.032709
dtype: float64
          C         D
3  1.193635  0.829713
C    1.193635
D    0.829713
dtype: float64
          C         D
5 -2.299704  1.610747
C   -2.299704
D    1.610747
dtype: float64
          C         D
0 -0.606588 -1.371519
6  0.610095 -0.781407
C    0.003507
D   -2.152926
dtype: float64
          C         D
7  0.338359  1.560452
C    0.338359
D    1.560452
dtype: float64
          C         D
2  0.741690 -0.898066
4  0.110306  1.859073
C    0.851996
D    0.961007
dtype: float64

          C         D
0  0.003507 -2.152926
1  0.084099 -0.032709
2  0.851996  0.961007
3  1.193635  0.829713
4  0.851996  0.961007
5 -2.299704  1.610747
6  0.003507 -2.152926
7  0.338359  1.560452

In [188]:
df_g.groupby(['A','B'])['C'].apply(list)

# 전달되는 index 와 C columns, 즉 series 을 볼수 있다.

A    B
bar  one                           [0.12247300570369539]
     three                        [-0.10489912481793448]
     two                           [-1.9284257038444086]
foo  one      [-1.3069104455072258, -1.4994528649545762]
     three                         [-1.2261999881760535]
     two       [1.7717789934729768, 0.22377917812934364]
Name: C, dtype: object

In [100]:
# 6개 유닉크한 AB 조합의 C (Series)가 전달됨 (bar,one) 부터 (foo,two)까지

def funX(g_SE : pd.Series.groupby) -> pd.Series.values:
    print(g_SE)
    g_SE = g_SE.sum()
    print(g_SE)
    return g_SE

df_g.groupby(['A','B'])['C'].apply(funX)

# funX 에서는 series을 다뤄야 한다.

1    0.084099
Name: (bar, one), dtype: float64
0.08409864249418036
3    1.193635
Name: (bar, three), dtype: float64
1.193634942180474
5   -2.299704
Name: (bar, two), dtype: float64
-2.2997041273202625
0   -0.606588
6    0.610095
Name: (foo, one), dtype: float64
0.003506552544479735
7    0.338359
Name: (foo, three), dtype: float64
0.33835911135095004
2    0.741690
4    0.110306
Name: (foo, two), dtype: float64
0.8519964132846954

A    B
bar  one      0.084099
     three    1.193635
     two     -2.299704
foo  one      0.003507
     three    0.338359
     two      0.851996
Name: C, dtype: float64

In [101]:
df_g.groupby(['A','B'])['C'].transform(funX)

# 연산 밖에서 컬럼을 정의하면, apply랑 결과가 같지만, funX 에서 column 을 구분할 순 없다.

1    0.084099
Name: (bar, one), dtype: float64
0.08409864249418036
3    1.193635
Name: (bar, three), dtype: float64
1.193634942180474
5   -2.299704
Name: (bar, two), dtype: float64
-2.2997041273202625
0   -0.606588
6    0.610095
Name: (foo, one), dtype: float64
0.003506552544479735
7    0.338359
Name: (foo, three), dtype: float64
0.33835911135095004
2    0.741690
4    0.110306
Name: (foo, two), dtype: float64
0.8519964132846954

0    0.003507
1    0.084099
2    0.851996
3    1.193635
4    0.851996
5   -2.299704
6    0.003507
7    0.338359
Name: C, dtype: float64

In [190]:
def funX(groupbyKey :pd.DataFrame.groupby) -> pd.Series.values :
    print(groupbyKey)
    g_SE =  groupbyKey['C'].sum()       # 전달 받은 groupby 별 C 컬럼들 의 sum  : groupby 갯수만큼 리턴
    print(g_SE)
    return g_SE

df_g.groupby(['A','B']).apply(funX)

     A    B         C         D
1  bar  one  0.122473 -0.101776
0.12247300570369539
     A      B         C        D
3  bar  three -0.104899  0.15317
-0.10489912481793448
     A    B         C         D
5  bar  two -1.928426  1.161292
-1.9284257038444086
     A    B         C         D
0  foo  one -1.306910 -0.611445
6  foo  one -1.499453 -1.308144
-2.806363310461802
     A      B       C         D
7  foo  three -1.2262 -0.522922
-1.2261999881760535
     A    B         C         D
2  foo  two  1.771779 -0.249892
4  foo  two  0.223779 -0.298740
1.9955581716023205

A    B
bar  one      0.122473
     three   -0.104899
     two     -1.928426
foo  one     -2.806363
     three   -1.226200
     two      1.995558
dtype: float64

In [191]:
def funX(g_SE : pd.Series.groupby) -> pd.Series.groupby:
    print(g_SE)
    if g_SE.shape[0] == 2:   # groupby index 에 따라 다르게 계산 
        g_SE = g_SE + 2
    else :
        g_SE = g_SE+1 
    print(g_SE)
    return g_SE  # 전달 받은 group 형태 그대로 전달한다.

myg_S = df_g.groupby(['A','B'])['C'].apply(funX)
myg_S

1    0.122473
Name: (bar, one), dtype: float64
1    1.122473
Name: (bar, one), dtype: float64
3   -0.104899
Name: (bar, three), dtype: float64
3    0.895101
Name: (bar, three), dtype: float64
5   -1.928426
Name: (bar, two), dtype: float64
5   -0.928426
Name: (bar, two), dtype: float64
0   -1.306910
6   -1.499453
Name: (foo, one), dtype: float64
0    0.693090
6    0.500547
Name: (foo, one), dtype: float64
7   -1.2262
Name: (foo, three), dtype: float64
7   -0.2262
Name: (foo, three), dtype: float64
2    1.771779
4    0.223779
Name: (foo, two), dtype: float64
2    3.771779
4    2.223779
Name: (foo, two), dtype: float64

A    B
bar  one    1    1.122473
     three  3    0.895101
     two    5   -0.928426
foo  one    0    0.693090
            6    0.500547
     three  7   -0.226200
     two    2    3.771779
            4    2.223779
Name: C, dtype: float64

In [193]:
# 동일하게 groupby 로 구성된 index 을 삭제하고, 기존 index 을 복구해야 한다. 

myg_S

A    B
bar  one    1    1.122473
     three  3    0.895101
     two    5   -0.928426
foo  one    0    0.693090
            6    0.500547
     three  7   -0.226200
     two    2    3.771779
            4    2.223779
Name: C, dtype: float64

In [194]:
myg_S.reset_index(drop=True, level=(0,1)).sort_index()

# 이제야 기존 (groupby 이전) df['C'] 에 해당 값을 없데이트 할 수 있음.

0    0.693090
1    1.122473
2    3.771779
3    0.895101
4    2.223779
5   -0.928426
6    0.500547
7   -0.226200
Name: C, dtype: float64

groupby().transform(funcX)

하나의 열 또는 행을 조작하는 것이지, 전체 데이터 프레임을 한번에 연산할 수 없다.  
따라서, 그룹화된 groupby() 컬럼 ['col'] 을 기존 인덱스 기준은 연산 funX 한다.  
groupby()['col'].transform(funX) = grouby()['col'].apply(funX).reset_index(level=, drop=Ture).sort_index()

In [198]:
df_g.groupby(['A','B'])['C'].transform(funX)

1    0.122473
Name: (bar, one), dtype: float64
1    1.122473
Name: (bar, one), dtype: float64
3   -0.104899
Name: (bar, three), dtype: float64
3    0.895101
Name: (bar, three), dtype: float64
5   -1.928426
Name: (bar, two), dtype: float64
5   -0.928426
Name: (bar, two), dtype: float64
0   -1.306910
6   -1.499453
Name: (foo, one), dtype: float64
0    0.693090
6    0.500547
Name: (foo, one), dtype: float64
7   -1.2262
Name: (foo, three), dtype: float64
7   -0.2262
Name: (foo, three), dtype: float64
2    1.771779
4    0.223779
Name: (foo, two), dtype: float64
2    3.771779
4    2.223779
Name: (foo, two), dtype: float64

0    0.693090
1    1.122473
2    3.771779
3    0.895101
4    2.223779
5   -0.928426
6    0.500547
7   -0.226200
Name: C, dtype: float64

In [642]:
pd.Series([[1,3],[2]])

0    [1, 3]
1       [2]
dtype: object

In [643]:
pd.DataFrame([[1,3],[2]])

   0    1
0  1  3.0
1  2  NaN

In [644]:
df_g.groupby(['A','B'])[['C']].sum().unstack(level=0)  # B 을 는 levle = 1

              C
A           bar       foo
B
one    0.799757  2.606813
three -1.129951  0.217999
two   -0.321869 -0.013941

### 8. Reshaping

```
reshpae(-1)
stack    : index <--- columns  
unstack  : index ---> columns  
pivot table
```

In [645]:
df_g.set_index(['A','B'])[['C']]#.unstack()

# Index contains duplicate entries, cannot reshape : 'foo one' 이 중복된다. 
# df.drop_duplicates(subset=['index','column']) 으로 해결

                  C
A   B
foo one    1.884121
bar one    0.799757
foo two   -0.479883
bar three -1.129951
foo two    0.465942
bar two   -0.321869
foo one    0.722692
    three  0.217999

drop_duplicates

subset : 중복을 검사할 column 
keep: 중복값중 남길 행

df.drop ()
axis = 0/1 (행/열)     조건이 있는 경우 slicing 을 이용하자

In [646]:
# df_g2 = df_g.drop([6,2]).reset_index(drop=True) 
# A,B 열 값이 중복되는 2, 6 row을 삭제

df_g2 = df_g.drop_duplicates(subset=['A','B'],keep='first', ignore_index=True).copy()  # inplace = True 으로 원본 적용

df_g2

     A      B         C         D
0  foo    one  1.884121 -0.030442
1  bar    one  0.799757 -0.890684
2  foo    two -0.479883 -0.892886
3  bar  three -1.129951 -0.339948
4  bar    two -0.321869 -0.775405
5  foo  three  0.217999  0.376879

In [647]:
df_g2.set_index(['A','B'])[['C']].unstack()

            C
B         one     three       two
A
bar  0.799757 -1.129951 -0.321869
foo  1.884121  0.217999 -0.479883

In [648]:
df_g2.pivot(index='A',columns='B',values='C')

B         one     three       two
A
bar  0.799757 -1.129951 -0.321869
foo  1.884121  0.217999 -0.479883

pivot_table()

In [649]:
df_g2.pivot_table(index ='A',columns='B',values='C')

# pd.pivot_table(df_g2, index ='A',columns='B',values='C')

B         one     three       two
A
bar  0.799757 -1.129951 -0.321869
foo  1.884121  0.217999 -0.479883

### 9. Time Series

In [650]:
rng = pd.date_range("1/1/2012", periods=100, freq="S")

ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

ts.resample("5Min").sum()

2012-01-01    27445
Freq: 5T, dtype: int64

In [651]:
ts

2012-01-01 00:00:00    495
2012-01-01 00:00:01    487
2012-01-01 00:00:02     22
2012-01-01 00:00:03    201
2012-01-01 00:00:04    383
                      ...
2012-01-01 00:01:35    494
2012-01-01 00:01:36    281
2012-01-01 00:01:37    432
2012-01-01 00:01:38    456
2012-01-01 00:01:39    470
Freq: S, Length: 100, dtype: int64

### 10. Categroicals

### 11. Plotting